# 数据的选取和索引

df[col]  

以数组 Series 的形式返回选取的列

In [1]:
import pandas as pd # 导入pandas库并简写为pd
import numpy as np # 导入numpy库并简写为np

In [2]:
df = pd.DataFrame(np.random.rand(5,5),columns=list('ABCDE'))

df

          A         B         C         D         E
0  0.579771  0.177346  0.368941  0.967295  0.436278
1  0.717489  0.723015  0.481006  0.310103  0.076067
2  0.801206  0.605464  0.542561  0.562129  0.379937
3  0.623712  0.991336  0.964132  0.785999  0.089550
4  0.655721  0.345396  0.611609  0.579988  0.564749

## 如果我们想选择B这一列，我们有以下四种方法

1. df.B

2. df['B']

3. df.loc[:,'B']

4. df.iloc[:,1]

In [5]:
df.iloc[:,1]

0    0.177346
1    0.723015
2    0.605464
3    0.991336
4    0.345396
Name: B, dtype: float64

# 如果我们想要选取1这一行，我们可以这么做

df.iloc[1,:]

In [8]:
df.iloc[1,:]

A    0.717489
B    0.723015
C    0.481006
D    0.310103
E    0.076067
Name: 1, dtype: float64

# 布尔索引（条件索引），

## 又或者是我需要选择df中大于0.5所有数据

In [9]:
df[df>0.5]

          A         B         C         D         E
0  0.579771       NaN       NaN  0.967295       NaN
1  0.717489  0.723015       NaN       NaN       NaN
2  0.801206  0.605464  0.542561  0.562129       NaN
3  0.623712  0.991336  0.964132  0.785999       NaN
4  0.655721       NaN  0.611609  0.579988  0.564749

## 选取df中A列大于0.5的部分

In [11]:
df.A[df.A>0.5]

0    0.579771
1    0.717489
2    0.801206
3    0.623712
4    0.655721
Name: A, dtype: float64

In [14]:
df['name']=list('ABCDE')

df

          A         B         C         D         E name
0  0.579771  0.177346  0.368941  0.967295  0.436278    A
1  0.717489  0.723015  0.481006  0.310103  0.076067    B
2  0.801206  0.605464  0.542561  0.562129  0.379937    C
3  0.623712  0.991336  0.964132  0.785999  0.089550    D
4  0.655721  0.345396  0.611609  0.579988  0.564749    E

In [15]:
df.query('name==["A"] | name==["C"]' )

          A         B         C         D         E name
0  0.579771  0.177346  0.368941  0.967295  0.436278    A
2  0.801206  0.605464  0.542561  0.562129  0.379937    C

In [19]:
df[(df.name=='A') | (df.name=='C') ]

          A         B         C         D         E name
0  0.579771  0.177346  0.368941  0.967295  0.436278    A
2  0.801206  0.605464  0.542561  0.562129  0.379937    C